<a href="https://colab.research.google.com/github/noushadkhan01/kansepur-flyash-project/blob/master/1-14-feb-bill5/1_14_feb_bill5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!git clone https://github.com/noushadkhan01/kansepur-flyash-project.git

Cloning into 'kansepur-flyash-project'...
remote: Enumerating objects: 15, done.
remote: Counting objects: 100% (15/15), done.
remote: Compressing objects: 100% (13/13), done.
remote: Total 255 (delta 3), reused 0 (delta 0), pack-reused 240
Receiving objects: 100% (255/255), 613.07 KiB | 3.10 MiB/s, done.
Resolving deltas: 100% (111/111), done.

In [0]:
import pandas as pd

In [3]:
%cd ./kansepur-flyash-project/1-14-feb-bill5/

/content/kansepur-flyash-project/1-14-feb-bill5

In [4]:
!ls

1_14_feb_bill.xlsx

In [5]:
df = pd.read_excel('1_14_feb_bill.xlsx', 'Sheet1')
df.head()

   S.No.       Date  Counts      Name  Quantity  Diesel
0    1.0 2019-02-01     1.0  khurseed       455     NaN
1    2.0        NaT     2.0     momin       415     NaN
2    3.0        NaT     3.0     jabir       419     NaN
3    4.0        NaT     4.0       NaN       420     NaN
4    5.0        NaT     5.0       NaN       496     NaN

In [6]:
df.tail(2)

     S.No.       Date  Counts   Name  Quantity  Diesel
270  271.0 2019-02-14     NaN  jabir       419     NaN
271    NaN        NaT     NaN    NaN    120388     NaN

In [7]:
df = df[:-1]
df.tail(1)

     S.No.       Date  Counts   Name  Quantity  Diesel
270  271.0 2019-02-14     NaN  jabir       419     NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271 entries, 0 to 270
Data columns (total 6 columns):
S.No.       271 non-null float64
Date        10 non-null datetime64[ns]
Counts      270 non-null float64
Name        4 non-null object
Quantity    271 non-null int64
Diesel      0 non-null float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(1)
memory usage: 12.8+ KB

In [9]:
unique_dates = df.Date.unique()
unique_dates = pd.Series(unique_dates).dropna()
print(unique_dates)

0    2019-02-01
2    2019-02-02
3    2019-02-05
4    2019-02-06
5    2019-02-07
6    2019-02-10
7    2019-02-11
8    2019-02-12
9    2019-02-13
10   2019-02-14
dtype: datetime64[ns]

In [10]:
df.Date.nunique()

10

In [11]:
df.Date.value_counts()

2019-02-07    1
2019-02-10    1
2019-02-13    1
2019-02-02    1
2019-02-05    1
2019-02-11    1
2019-02-14    1
2019-02-06    1
2019-02-12    1
2019-02-01    1
Name: Date, dtype: int64

In [0]:
import numpy as np

### Fill Date

In [0]:
for n, i in enumerate(df.Date.values):
  if not pd.isnull(i):
    date = i
  else:
    df.iloc[n, 0] = date

In [0]:
df.head(2)

                           S.No.       Date  Count      Name  Quantity
0                              1 2019-01-15    1.0  mustakim       405
1  2019-01-15T00:00:00.000000000        NaT    2.0    shabir       470

In [0]:
df.Name.unique()

array(['mustakim', 'shabir', 'isran', 'farookh', 'aarif', 'toheed',
       'kayum', 'intazar', 'rasid', 'wajid', 'hasan', 'rafakat', 'haseen',
       'aashu', 'gulfam', 'irsad', 'mehmood', 'jabir', 'shokeen', 'momin',
       'khurseed', 'anwar', 'amjad'], dtype=object)

In [13]:
sum(df.Quantity)

120388

In [0]:
quantity_per_name = df.Name.value_counts()
quantity_per_name

rasid       29
hasan       29
farookh     28
isran       27
haseen      25
gulfam      23
momin       22
shokeen     21
khurseed    21
mustakim    21
toheed      21
irsad       17
wajid       16
rafakat     15
aashu       15
aarif       15
shabir      12
jabir       12
mehmood      8
amjad        8
anwar        7
kayum        6
intazar      1
Name: Name, dtype: int64

### Counts per Date

In [0]:
df.isnull().sum()

S.No.         0
Date        387
Count         0
Name          0
Quantity      0
dtype: int64

## unique feets per name

In [0]:
group = df.groupby(df.Name)
group

for i, j in group:
  print(i, '\n', j.Quantity, '\n')

In [0]:
for i, j in group:
  print(i, j.Quantity.unique(), '\n')

aarif [416]

aashu [430]

amjad [411]

anwar [395]

farookh [420]

gulfam [500]

hasan [538 498 508 488 518]

haseen [496]

intazar [517]

irsad [435]

isran [470]

jabir [419]

kayum [450]

khurseed [410 380 455]

mehmood [420 470 500 538 415 419 405]

momin [415]

mustakim [405]

rafakat [538]

rasid [410]

shabir [470]

shokeen [453]

toheed [486 320]

wajid [419]

# Diesel

In [14]:
diesel = pd.read_excel('1_14_feb_bill.xlsx', 'Diesel')
diesel.head()

        Date   Name  Diesel    cash
0 2019-02-01  hasan    2000     NaN
1        NaT  aarif    2000     NaN
2        NaT  jabir    2000     NaN
3        NaT  aashu    1500  1000.0
4        NaT  rasid    1500     NaN

In [15]:
diesel.shape

(125, 4)

In [17]:
diesel.Date.unique()

array(['2019-02-01T00:00:00.000000000',                           'NaT',
       '2019-02-02T00:00:00.000000000', '2019-02-05T00:00:00.000000000',
       '2019-02-06T00:00:00.000000000', '2019-02-07T00:00:00.000000000',
       '2019-02-10T00:00:00.000000000', '2019-02-11T00:00:00.000000000',
       '2019-02-12T00:00:00.000000000', '2019-02-13T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [0]:
for n, i in enumerate(diesel.Date.values):
  if not pd.isnull(i):
    date = i
  else:
    diesel.iloc[n, 0] = date

In [21]:
diesel.head()

        Date   Name  Diesel    cash
0 2019-02-01  hasan    2000     NaN
1 2019-02-01  aarif    2000     NaN
2 2019-02-01  jabir    2000     NaN
3 2019-02-01  aashu    1500  1000.0
4 2019-02-01  rasid    1500     NaN

# pivot table

In [22]:
diesel.pivot_table(index = 'Name', columns = 'Date', values = 'Diesel')

Date,2019-02-01 00:00:00,2019-02-02 00:00:00,2019-02-05 00:00:00,2019-02-06 00:00:00,2019-02-07 00:00:00,2019-02-10 00:00:00,2019-02-11 00:00:00,2019-02-12 00:00:00,2019-02-13 00:00:00
Name,,,,,,,,,
Total,43500.0,3000.0,32000.0,30000.0,21000.0,32000.0,39000.0,36500.0,30000.0
aarif,2000.0,NaN,2000.0,2000.0,NaN,NaN,2000.0,2500.0,1500.0
aashu,1500.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
amjad,NaN,NaN,2000.0,2000.0,1000.0,NaN,NaN,2000.0,NaN
cash,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8500.0
farookh,1500.0,NaN,NaN,NaN,NaN,2000.0,2000.0,1500.0,2000.0
gulfam,NaN,NaN,NaN,2000.0,2000.0,2000.0,NaN,2000.0,2000.0
hasan,2000.0,1000.0,1500.0,1500.0,NaN,2000.0,2000.0,1500.0,1000.0
haseen,2000.0,NaN,2000.0,2000.0,1500.0,2000.0,2500.0,1500.0,1500.0
irsad,NaN,NaN,NaN,500.0,2000.0,NaN,2000.0,2000.0,1500.0
isran,NaN,NaN,2000.0,2000.0,1000.0,2000.0,2000.0,2000.0,1500.0
jabir,2000.0,NaN,2000.0,2000.0,1000.0,2000.0,2500.0,1500.0,2000.0
khurseed,NaN,2000.0,2000.0,1300.0,NaN,2000.0,2000.0,2000.0,NaN
momin,2000.0,NaN,2000.0,1270.0,NaN,1500.0,NaN,2000.0,1500.0
mustakim,NaN,NaN,NaN,1500.0,NaN,2000.0,2000.0,2000.0,1500.0
noushad,9500.0,NaN,4240.0,3430.0,4000.0,4000.0,8500.0,6500.0,NaN
poclain,3500.0,NaN,5260.0,5000.0,4000.0,3500.0,3000.0,3500.0,NaN
rafakat,2000.0,NaN,2000.0,NaN,NaN,NaN,NaN,NaN,NaN
rasid,1500.0,NaN,1500.0,1500.0,NaN,2000.0,2000.0,NaN,NaN
sabir,NaN,NaN,NaN,NaN,2500.0,NaN,NaN,NaN,NaN
sabir jcb,10000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sabir moti,NaN,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sanjay,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2500.0
shabir,2000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
shokeen,NaN,NaN,2000.0,NaN,NaN,1500.0,2000.0,NaN,1500.0
toheed,2000.0,NaN,1500.0,NaN,NaN,2000.0,2500.0,1500.0,NaN
wajid,NaN,NaN,NaN,2000.0,2000.0,1000.0,2000.0,2500.0,1500.0

# Total Quantity per name

In [0]:
name_groups = df.groupby('Name')
name_total_quantity = pd.DataFrame(columns = ['Name', 'Total Quantity'])
for i, j in name_groups:
  name_total_quantity = name_total_quantity.append({'Name':i, 'Total Quantity': sum(j.Quantity)}, ignore_index = True)
  
name_total_quantity.sort_values(by = ['Total Quantity'], ascending = False, inplace = True)

In [0]:
name_total_quantity

        Name Total Quantity
6      hasan          15462
10     isran          12690
7     haseen          12400
18     rasid          11890
4    farookh          11760
5     gulfam          11500
20   shokeen           9513
15     momin           9130
13  khurseed           8805
16  mustakim           8505
17   rafakat           8070
21    toheed           8048
9      irsad           7395
22     wajid           6704
1      aashu           6450
0      aarif           6240
19    shabir           5640
11     jabir           5028
14   mehmood           3637
2      amjad           3288
3      anwar           2765
12     kayum           2700
8    intazar            517

In [0]:
diesel.head(1)

,Name,2019-01-15 00:00:00,2019-01-16 00:00:00,2019-01-20 00:00:00,2019-01-21 00:00:00,2019-01-24 00:00:00,2019-01-25 00:00:00,2019-01-26 00:00:00,2019-01-27 00:00:00,2019-01-28 00:00:00,2019-01-29 00:00:00,2019-01-30 00:00:00,2019-01-31 00:00:00,Total Diesel
0,aarif,2000,0,0,0,0,0,2000,2000,2000,0,0,2000,10000

In [0]:
diesel = diesel[['Name', 'Total Diesel']]
diesel.sort_values(by = 'Total Diesel', ascending = False, inplace = True)
diesel

         Name  Total Diesel
24    Zztotal        384500
23     zzcash         51170
14    poclain         45500
6       hasan         21130
5      gulfam         19000
4     farookh         18500
17  sabir jcb         18500
16      rasid         17470
15    rafakat         16500
9       isran         16500
7      haseen         16330
21     toheed         14500
20    shokeen         13500
8       irsad         13000
18      momin         13000
12   khurseed         12900
1       aashu         12000
22      wajid         12000
19     shabir         10500
13   mustakim         10000
0       aarif         10000
10      jabir          8000
2       amjad          6000
3       anwar          5000
11      kayum          3500

In [0]:
name_total_quantity.shape

(23, 2)

In [0]:
diesel.shape

(25, 2)

In [0]:
final = pd.DataFrame(columns = ['Name','Count' , 'Total Quantity', 'Amount', 'Diesel', 'Amount - Diesel','Balance(Amount - Diesel)'])
for i in range(len(name_total_quantity)):
  for j in range(len(diesel)):
    if name_total_quantity.Name[i] == diesel.Name[j]:
      final = final.append({'Name': diesel.Name[j],'Total Quantity':name_total_quantity['Total Quantity'][i] ,
                            'Count':quantity_per_name.get(diesel.Name[j]),
                            'Amount':name_total_quantity['Total Quantity'][i]*3,
                            'Diesel':diesel['Total Diesel'][j],
                            'Amount - Diesel':name_total_quantity['Total Quantity'][i]*3 - diesel['Total Diesel'][j],
                           'Balance(Amount - Diesel)': name_total_quantity['Total Quantity'][i]*3 - diesel['Total Diesel'][j]},
                           ignore_index = True)

In [0]:
final.sort_values(by = 'Total Quantity', ascending = False, inplace = True)
final

,Name,Count,Total Quantity,Amount,Diesel,Amount - Diesel,Balance(Amount - Diesel)
6,hasan,29,15462,46386,21130,25256,25256
9,isran,27,12690,38070,16500,21570,21570
7,haseen,25,12400,37200,16330,20870,20870
16,rasid,29,11890,35670,17470,18200,18200
4,farookh,28,11760,35280,18500,16780,16780
5,gulfam,23,11500,34500,19000,15500,15500
18,shokeen,21,9513,28539,13500,15039,15039
13,momin,22,9130,27390,13000,14390,14390
12,khurseed,21,8805,26415,12900,13515,13515
14,mustakim,21,8505,25515,10000,15515,15515
15,rafakat,15,8070,24210,16500,7710,7710
19,toheed,21,8048,24144,14500,9644,9644
8,irsad,17,7395,22185,13000,9185,9185
20,wajid,16,6704,20112,12000,8112,8112
1,aashu,15,6450,19350,12000,7350,7350
0,aarif,15,6240,18720,10000,8720,8720
17,shabir,12,5640,16920,10500,6420,6420
10,jabir,12,5028,15084,8000,7084,7084
2,amjad,8,3288,9864,6000,3864,3864
3,anwar,7,2765,8295,5000,3295,3295
11,kayum,6,2700,8100,3500,4600,4600

In [0]:
final.shape

(21, 7)

# Total payable

In [0]:
sum(final['Amount - Diesel'])

252619

# Total Diesel to peoples

In [0]:
sum(final['Diesel'])

269330

In [0]:
to_tractors = sum(final['Total Quantity'])
to_tractors

173983

In [0]:
to_tractors + name_total_quantity[name_total_quantity.Name == 'mehmood']['Total Quantity']

14    177620
Name: Total Quantity, dtype: object